Modul15Full/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МУ_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.МУ_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>МУ_СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Modul15Full/src/HTTPServices/Courier/Module.bsl
Функция PingПроверкаПодключения(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);   
	Ответ.УстановитьТелоИзСтроки("Ok");
	Возврат Ответ;
КонецФункции

Функция OrderПолучитьЗаказы(Запрос)   
	ЗапросОтбора = Новый Запрос;
	ЗапросОтбора.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(ЗаказПокупателя.Ссылка) КАК КоличествоЗаказов
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ответственный = &Ответственный";
	ЗапросОтбора.УстановитьПараметр("Ответственный",ПараметрыСеанса.ТекущийПользователь);
	Выборка = ЗапросОтбора.Выполнить().Выбрать();  
	Выборка.Следующий();
	КоличествоЗаказов = Выборка.КоличествоЗаказов;
	
	Ответ = Новый HTTPСервисОтвет(200);                    
	//.Наименование
  
	Ответ.УстановитьТелоИзСтроки(Строка(КоличествоЗаказов));  
	Возврат Ответ;
КонецФункции
